Autodesk.Revit.DB.GeometryConversionOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.GeometryConversionOptions.MeshEdgeVisibilityOption
Specifies the visibility of mesh edges.
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions.SolidConversionPriorities
Specifies the conversion priorities for import of ATF solids.
By default Solids are preferred and Meshes are used as a backup.
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions.MeshConversionPriorities
Specifies the conversion priorities for import of ATF meshes.
By default Solids are preferred and Meshes are used as a backup.
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions.#ctor
Creates a default GeometryConversionOptions which specifies conversion preferentially
to Solid then to Mesh for both external meshes and solids.
Since:
2022

Autodesk.Revit.DB.GeometryConversionOptions
Specifies the priorities for conversion of ATF mesh to Revit geometry, and ATF solid to Revit geometry.
By default, ATF geometry is preferentially converted to solids and if that conversion fails an attempt
to convert to a Revit Mesh will be made instead.
Since:
2022